MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.h
/** @defgroup COMP_Exported_Functions_Group2 Configuration functions
  * @{
  */
hal_status_t HAL_COMP_SetConfig(hal_comp_handle_t *hcomp, const hal_comp_config_t *p_config);
void HAL_COMP_GetConfig(const hal_comp_handle_t *hcomp, hal_comp_config_t *p_config);

hal_status_t HAL_COMP_SetInputPlus(hal_comp_handle_t *hcomp, hal_comp_input_plus_t input_plus);
hal_comp_input_plus_t HAL_COMP_GetInputPlus(const hal_comp_handle_t *hcomp);
hal_status_t HAL_COMP_SetInputMinus(hal_comp_handle_t *hcomp, hal_comp_input_minus_t input_minus);
hal_comp_input_minus_t HAL_COMP_GetInputMinus(const hal_comp_handle_t *hcomp);

hal_status_t HAL_COMP_SetOutputBlanking(hal_comp_handle_t *hcomp, hal_comp_output_blank_t output_blank);
hal_comp_output_blank_t HAL_COMP_GetOutputBlanking(hal_comp_handle_t *hcomp);

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
hal_status_t HAL_COMP_WINDOW_SetConfig(hal_comp_handle_t *hcomp, const hal_comp_window_config_t *p_config);
void HAL_COMP_WINDOW_GetConfig(const hal_comp_handle_t *hcomp, hal_comp_window_config_t *p_config);

hal_status_t HAL_COMP_WINDOW_SetInput(hal_comp_handle_t *hcomp, hal_comp_input_plus_t input);
hal_comp_input_plus_t HAL_COMP_WINDOW_GetInput(const hal_comp_handle_t *hcomp);
hal_status_t HAL_COMP_WINDOW_SetUpperThreshold(hal_comp_handle_t *hcomp, hal_comp_input_minus_t upper_threshold);
hal_comp_input_minus_t HAL_COMP_WINDOW_GetUpperThreshold(const hal_comp_handle_t *hcomp);
hal_status_t HAL_COMP_WINDOW_SetLowerThreshold(hal_comp_handle_t *hcomp, hal_comp_input_minus_t lower_threshold);
hal_comp_input_minus_t HAL_COMP_WINDOW_GetLowerThreshold(const hal_comp_handle_t *hcomp);

hal_status_t HAL_COMP_WINDOW_SetOutputBlanking(hal_comp_handle_t *hcomp, hal_comp_output_blank_t output_blank);
hal_comp_output_blank_t HAL_COMP_WINDOW_GetOutputBlanking(const hal_comp_handle_t *hcomp);
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */
/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group3 IRQHandler and Callbacks functions
  * @{
  */
void HAL_COMP_IRQHandler(hal_comp_handle_t *hcomp);
void HAL_COMP_OutputTriggerCallback(hal_comp_handle_t *hcomp);
#if defined (USE_HAL_COMP_REGISTER_CALLBACKS) && (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
hal_status_t HAL_COMP_RegisterOutputTriggerCallback(hal_comp_handle_t *hcomp, hal_comp_cb_t p_callback);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group4 Peripheral State, Error functions
  * @{
  */
hal_comp_state_t HAL_COMP_GetState(const hal_comp_handle_t *hcomp);
/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group5 Process functions
  * @{
  */
hal_status_t HAL_COMP_Start(hal_comp_handle_t *hcomp);
hal_status_t HAL_COMP_Stop(hal_comp_handle_t *hcomp);
#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
hal_status_t HAL_COMP_Start_IT(hal_comp_handle_t *hcomp);
hal_status_t HAL_COMP_Stop_IT(hal_comp_handle_t *hcomp);
#endif /* USE_HAL_COMP_EXTI */
hal_status_t HAL_COMP_Lock(hal_comp_handle_t *hcomp);
hal_comp_lock_status_t HAL_COMP_IsLocked(hal_comp_handle_t *hcomp);
hal_comp_output_level_t HAL_COMP_GetOutputLevel(hal_comp_handle_t *hcomp);
#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
hal_status_t HAL_COMP_WINDOW_Start(hal_comp_handle_t *hcomp);
hal_status_t HAL_COMP_WINDOW_Stop(hal_comp_handle_t *hcomp);
#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
hal_status_t HAL_COMP_WINDOW_Start_IT(hal_comp_handle_t *hcomp);
hal_status_t HAL_COMP_WINDOW_Stop_IT(hal_comp_handle_t *hcomp);
#endif /* USE_HAL_COMP_EXTI */
hal_status_t HAL_COMP_WINDOW_Lock(hal_comp_handle_t *hcomp);
hal_comp_lock_status_t HAL_COMP_WINDOW_IsLocked(hal_comp_handle_t *hcomp);
hal_comp_window_output_level_t HAL_COMP_WINDOW_GetOutputLevel(hal_comp_handle_t *hcomp);
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */
/**
  * @}
  */

/** @defgroup COMP_Exported_Functions_Group6 User data functions
  * @{
  */
#if defined(USE_HAL_COMP_USER_DATA) && (USE_HAL_COMP_USER_DATA == 1)
void HAL_COMP_SetUserData(hal_comp_handle_t *hcomp, const void *p_user_data);
const void *HAL_COMP_GetUserData(const hal_comp_handle_t *hcomp);
#endif /* USE_HAL_COMP_USER_DATA */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* COMP1 || COMP2 || COMP3 || COMP4 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_COMP_H */
